package ru.durak.Kostya.model.abstraction.game;

/**
 * Колода.
 * @param <T> Тип элемента колоды.
 */
public interface Deck<T> {

    /**
     * Метод, добавляющий элемент на верх колоды.
     * @param value Элемент для добавления.
     */
    void push(T value);

   /**
     * Метод, возвращающий верхний элемент колоды и удаляющий его из колоды.
     * @return Верхний элемент колоды.
     */
    T pop();

    /**
     * Метод, возвращающий нижний элемент колоды.
     * @return Нижний элемент колоды.
     */
    T peekLast();

    /**
     * Метод, возвращающий колличество элементов в колоде.
     * @return Колличество элементов в колоде.
     */
    int count();

    /**
     * Метод, перемешивающий элементы в колоде.
     */
    void shuffle();
}